/* ATmega128芯片 SPI的驱动文件*/

#include <iom128a.h>
#include <RegBit.h>
/***********************************************************************
函数功能：SPI初始化
操作内容：1、设置端口输入输出属性
		  2、设置SPI接口相关寄存器
          3、支持常用AVR单片机接口，兼容性增强，可扩展
***********************************************************************/
//PB0 - PB3 SS SCK MOSI MISO
void SPI_Init(void)
{
	PORTB |= (1 << PB1);	//设置SCK为1
	DDRB  |= (1 << DDB1);	//设置SCK为输出模式
	DDRB  &=~(1 << DDB3);	//设置MISO为输入模式
	DDRB  |= (1 << DDB2);	//设置MOSI为输出模式
	DDRB  |= (1 << DDB0);	//主机模式下，设置SS为输出，从机的片选
	
	PORTB |= (1 << DDB0);	//SS置高电平，片选无效
	
//	SPCR = 
}
